

// var birthdays = [
//     {"fio": "Агарин Алексей Александрович", "date": "04.08.1987"},
//     {"fio": "Антонюк Ирина", "date": "08.12.1985"},
//     {"fio": "Аришин Алексей Алексеевич", "date": "11.02.1989"},
//     {"fio": "Артемова Юлия Эдуардовна", "date": "13.08.1992"},
//     {"fio": "Бессонова Ксения Михайловна", "date": "22.06.1990"},
//     {"fio": "Бочина Инна Владимировна", "date": "20.03.1985"},
//     {"fio": "Буслов Владислав Алексеевич", "date": "23.05.1988"},
//     {"fio": "Бухаров Константин", "date": "14.02.2019"},
//     {"fio": "Вайтович Владислав Владимирович", "date": "04.12.1982"},
//     {"fio": "Волкова Ирина Анатольевна", "date": "12.02.1977"},
//     {"fio": "Гетало Светлана Владимировна", "date": "27.10.1989"},
//     {"fio": "Гладкова Елена Александровна", "date": "22.11.1987"},
//     {"fio": "Гуцалов Николай Георгиевич", "date": "22.08.1991"},
//     {"fio": "Данильчик Алексей Алексеевич", "date": "20.07.1987"},
//     {"fio": "День программиста (256-й день в году)", "date": "13.09.2018"},
//     {"fio": "Толкач Мария Владимировна", "date": "10.11.1994"},
//     {"fio": "Дорошенко Алла Александровна", "date": "17.05.1979"},
//     {"fio": "Джабаров Ростислав Русланович", "date": "07.11.1989"},
//     {"fio": "Ефимцев Никита Эдуардович", "date": "25.04.1997"},
//     {"fio": "Жучкина Юлия Сергеевна", "date": "07.08.1991"},
//     {"fio": "Кантемиров Иван", "date": "29.01.1988"},
//     {"fio": "Киреев Петр Николаевич", "date": "06.01.1982"},
//     {"fio": "Кобзев Кирилл Олегович", "date": "08.07.1992"},
//     {"fio": "Когут Константин Васильевич", "date": "27.11.1987"},
//     {"fio": "Коптелов Владимир Владимирович", "date": "28.10.1988"},
//     {"fio": "Кочакова Оксана Сергеевна", "date": "26.05.1987"},
//     {"fio": "Кривонос Юлия Анатольевна", "date": "14.11.1987"},
//     {"fio": "Крижановская Ксения Сергеевна", "date": "10.02.1987"},
//     {"fio": "Кузьминов Михаил КОРУС", "date": "27.12.2018"},
//     {"fio": "Кураева Светлана Вячеславовна", "date": "20.04.1987"},
//     {"fio": "Кусь Валентина Сергеевна", "date": "21.03.1992"},
//     {"fio": "Лоскутов Алексей Юрьевич", "date": "15.08.1991"},
//     {"fio": "Лунина Люся", "date": "11.07.2019"},
//     {"fio": "Мазько Андрей Юрьевич", "date": "08.06.1988"},
//     {"fio": "Малахов Денис", "date": "25.06.1982"},
//     {"fio": "Мирзоян Мушег Артаваздович", "date": "11.01.1992"},
//     {"fio": "Мухин Станислав Владимирович", "date": "08.06.1989"},
//     {"fio": "Никитин Андрей Валерьевич", "date": "12.08.1997"},
//     {"fio": "Омельницкий Роман Николаевич", "date": "18.04.1995"},
//     {"fio": "Пастухов Александр Викторович", "date": "17.04.1989"},
//     {"fio": "Патрикеева Светлана Григорьевна", "date": "30.12.1986"},
//     {"fio": "Попов Илья Александрович", "date": "19.07.1995"},
//     {"fio": "Прохоренко Игорь Игоревич", "date": "27.05.1991"},
//     {"fio": "Рогожин Яков Юрьевич", "date": "29.05.1989"},
//     {"fio": "Рукавишников Илья Владимирович", "date": "11.06.1989"},
//     {"fio": "Русин Алексей Викторович", "date": "24.09.1992"},
//     {"fio": "Рыбаков Алексей Александрович", "date": "01.07.1988"},
//     {"fio": "Рыбин Владимир Викторович", "date": "10.06.1988"},
//     {"fio": "Сазанский Виталий Александрович", "date": "30.04.1995"},
//     {"fio": "Сальников Андрей Владимирович", "date": "29.11.1994"},
//     {"fio": "Саржанов Дима", "date": "04.09.1972"},
//     {"fio": "Саржанова Марина", "date": "14.08.1982"},
//     {"fio": "Сергиенко Евгений Степанович", "date": "25.07.1978"},
//     {"fio": "Солдатиков Александр Александрович", "date": "26.07.1982"},
//     {"fio": "Старков Константин Викторович", "date": "16.06.1981"},
//     {"fio": "Стрембицкая Любовь Сергеевна", "date": "06.06.1986"},
//     {"fio": "Тимофеев Александр Викторович", "date": "08.08.1986"},
//     {"fio": "Тимохин Игорь Владимирович", "date": "08.01.1987"},
//     {"fio": "Хажмакова Саида Шамсудиновна", "date": "07.10.1987"},
//     {"fio": "Холодков Юрий Юрьевич", "date": "31.01.1992"},
//     {"fio": "Худокормова Елена Петровна", "date": "29.06.1985"},
//     {"fio": "Чепурко Олег Вадимович", "date": "30.07.1986"},
//     {"fio": "Чистяков Игорь Николаевич", "date": "26.12.1986"},
//     {"fio": "Шульга Ольга Сергеевна", "date": "21.10.1986"},
//     {"fio": "Аникиев Антон Николаевич", "date": "02.03.1991"},
//     {"fio": "Анцупов Александр Владимирович", "date": "04.05.1977"},
//     {"fio": "Бабикова Елена Михайловна", "date": "20.05.1980"},
//     {"fio": "Багреева Елизавета Федоровна", "date": "06.11.1986"},
//     {"fio": "Байчерова Ольга Владимировна", "date": "15.09.1988"},
//     {"fio": "Банникова Анна Валерьевна", "date": "28.10.1986"},
//     {"fio": "Бахтина Дарья Сергеевна", "date": "08.10.1993"},
//     {"fio": "Белюсева Вероника Викторовна", "date": "14.08.1987"},
//     {"fio": "Беляков Сергей Павлович", "date": "29.05.1962"},
//     {"fio": "Белянская Зоя Александровна", "date": "09.04.1989"},
//     {"fio": "Береза Лена", "date": "18.05.1982"},
//     {"fio": "Биденко Настя", "date": "08.05.1988"},
//     {"fio": "Блоха Екатерина Николаевна", "date": "19.07.1992"},
//     {"fio": "Бонарь Эвелина Геннадьевна", "date": "29.05.1989"},
//     {"fio": "Борт Анатолий Георгиевич", "date": "15.07.1986"},
//     {"fio": "Брат", "date": "15.07.1972"},
//     {"fio": "Буслова Мария", "date": "31.01.2017"},
//     {"fio": "Бятец Екатерина Валерьевна", "date": "10.11.1983"},
//     {"fio": "Василенко Андрей Владимирович", "date": "30.05.1982"},
//     {"fio": "Видинеева Марианна", "date": "29.11.1981"},
//     {"fio": "Видинеев Виталий", "date": "03.08.1981"},
//     {"fio": "Владимирова Наталья Викторовна", "date": "25.02.1974"},
//     {"fio": "Волошин Женя", "date": "16.01.2018"},
//     {"fio": "Волошина Елена Васильевна", "date": "12.08.1977"},
//     {"fio": "Волчанская Екатерина Евгеньевна", "date": "03.05.1992"},
//     {"fio": "Вотинцева Наталья Викторовна", "date": "03.11.1991"},
//     {"fio": "Гавриленко Людмила Сергеевна", "date": "17.02.1988"},
//     {"fio": "Галеев Михаил Андреевич", "date": "24.07.1986"},
//     {"fio": "Глушков Михаил Сергеевич", "date": "26.10.1986"},
//     {"fio": "Горьков Константин Александрович", "date": "19.03.2017"},
//     {"fio": "Григорович Игорь Викторович", "date": "01.07.1971"},
//     {"fio": "Грунтович Юлия Викторовна", "date": "16.12.1980"},
//     {"fio": "Грушевская Евгения Владимировна", "date": "22.08.1986"},
//     {"fio": "Гучетль Тимур", "date": "01.12.1981"},
//     {"fio": "Гяго Дарья Геннадьевна", "date": "01.07.2017"},
//     {"fio": "Дворниченко Майя Юрьевна", "date": "26.05.1979"},
//     {"fio": "Демченко Денис Алексеевич", "date": "18.07.1987"},
//     {"fio": "День работника торговли", "date": "28.07.2018"},
//     {"fio": "Деревяшкин Максим", "date": "29.05.1977"},
//     {"fio": "Деревяшкина Лиля", "date": "06.09.1981"},
//     {"fio": "Дешук Евгения Андреевна", "date": "18.03.1990"},
//     {"fio": "Джалалова Лола Наримановна", "date": "17.09.1988"},
//     {"fio": "Дзугулова Валерия Валерьевна", "date": "10.08.1978"},
//     {"fio": "Димон", "date": "29.08.2001"},
//     {"fio": "Долгов Александр", "date": "17.11.1978"},
//     {"fio": "Дудник Владимир Александрович", "date": "29.11.1981"},
//     {"fio": "Евдаха Евгения Александровна", "date": "17.06.1991"},
//     {"fio": "Еремеев Денис Андреевич", "date": "30.12.1990"},
//     {"fio": "Ерохина Екатерина Владимировна", "date": "16.10.1988"},
//     {"fio": "Жарук Денис Дмитриевич", "date": "25.11.1983"},
//     {"fio": "Жилина Елена Борисовна", "date": "10.12.1963"},
//     {"fio": "Жиров Сергей Павлович", "date": "22.05.1991"},
//     {"fio": "Захарова Светлана Анатольевна", "date": "21.12.2016"},
//     {"fio": "Зеленский Дмитрий Юрьевич", "date": "23.08.1979"},
//     {"fio": "Зиминова Лидия Александровна", "date": "14.05.1984"},
//     {"fio": "Золотийчук Оксана Геннадьевна", "date": "09.04.1981"},
//     {"fio": "Зубкова Ольга Владимировна", "date": "20.02.1986"},
//     {"fio": "Зыкова Мария Николаевна", "date": "17.06.1987"},
//     {"fio": "Иванова Евгения Олеговна", "date": "15.12.1987"},
//     {"fio": "Казарова Карина Игоревна", "date": "17.11.1988"},
//     {"fio": "Капинус Ирина Викторовна", "date": "27.05.1988"},
//     {"fio": "Карданова Александра Владиславовна", "date": "09.01.1989"},
//     {"fio": "Касавченко Святослав Александрович", "date": "27.07.1971"},
//     {"fio": "Касовская Ирина Владимировна", "date": "25.02.1986"},
//     {"fio": "Качаева Ирина Олеговна", "date": "23.06.1992"},
//     {"fio": "Кириллова Наталья Михайловна", "date": "06.10.1986"},
//     {"fio": "Климов Максим Николаевич", "date": "08.11.1989"},
//     {"fio": "Княжева Ксения Александровна", "date": "29.07.1993"},
//     {"fio": "Коваленко Геннадий Олегович", "date": "21.12.1986"},
//     {"fio": "Кожинова Екатерина Юрьевна", "date": "23.02.1990"},
//     {"fio": "Коляда Алина Геннадьевна", "date": "01.04.1993"},
//     {"fio": "Коновалова Екатерина Михайловна", "date": "24.05.1991"},
//     {"fio": "Коноплева Ирина Валерьевна", "date": "01.12.1991"},
//     {"fio": "Косолапов Виталий Юрьевич", "date": "10.06.1994"},
//     {"fio": "Кошко Асиет Руслановна", "date": "19.07.1984"},
//     {"fio": "Кравченко Анна Борисовна", "date": "17.02.1982"},
//     {"fio": "Крикса Ирина Андреевна", "date": "25.10.1986"},
//     {"fio": "Крикунова Ирина Сергеевна", "date": "05.10.1991"},
//     {"fio": "Крыщенко Надежда Юрьевна", "date": "30.04.1987"},
//     {"fio": "Ксенофондова Алина", "date": "11.07.1991"},
//     {"fio": "Кузнецова Анастасия Сергеевна", "date": "07.03.1994"},
//     {"fio": "Кузнецова Татьяна Владимировна", "date": "27.05.1985"},
//     {"fio": "Кузьминов Сергей Александрович", "date": "24.03.1978"},
//     {"fio": "Куприна Татьяна Дмитриевна", "date": "11.10.1993"},
//     {"fio": "Кухлев Борис Евгеньевич", "date": "23.09.1985"},
//     {"fio": "Кушу Руслан Алиевич", "date": "24.05.1988"},
//     {"fio": "Кущев Юрий Анатольевич", "date": "14.12.1987"},
//     {"fio": "Лавриченко Сергей Викторович", "date": "25.10.2016"},
//     {"fio": "Латуш Анастасия Анатольевна", "date": "17.07.1991"},
//     {"fio": "Левицкая Мария", "date": "23.08.2018"},
//     {"fio": "Литвинова Ольга Юрьевна", "date": "07.12.1992"},
//     {"fio": "Лихачева Юлия Сергеевна", "date": "12.11.2016"},
//     {"fio": "Лозовая Светлана Сергеевна", "date": "27.06.1994"},
//     {"fio": "Лубенцова Тамара Константиновна", "date": "08.06.1992"},
//     {"fio": "Лурье Евгений Валентинович", "date": "28.10.2017"},
//     {"fio": "Лямина Светлана Игоревна", "date": "10.12.2018"},
//     {"fio": "Лях Андрей Андреевич", "date": "23.07.1990"},
//     {"fio": "Майорова Дарья Игоревна", "date": "25.09.1994"},
//     {"fio": "Макарова Валерия Олеговна", "date": "08.05.1993"},
//     {"fio": "Малахова Наташа", "date": "09.09.1982"},
//     {"fio": "Малюк Ирина Владимировна", "date": "21.02.1985"},
//     {"fio": "Мама", "date": "06.08.1944"},
//     {"fio": "Маргарян Лусине Гегамовна", "date": "11.05.1997"},
//     {"fio": "Марюхин Сергей Иванович", "date": "29.05.1986"},
//     {"fio": "Матвиенко Алена Валерьевна", "date": "12.06.1992"},
//     {"fio": "Медведева Ксения Владимировна", "date": "14.03.1986"},
//     {"fio": "Медведева Татьяна Борисовна", "date": "19.03.1981"},
//     {"fio": "Мелитонян Эльвира Альбертовна", "date": "01.05.1991"},
//     {"fio": "Мершавка Иван Владимирович", "date": "02.11.1984"},
//     {"fio": "Мещиряков Степан Васильевич", "date": "29.10.1981"},
//     {"fio": "Моренец Александра Александровна", "date": "25.04.1985"},
//     {"fio": "Мурадова Тамара Эдуардовна", "date": "03.04.1990"},
//     {"fio": "Настенко Юлия Алексеевна", "date": "05.10.1991"},
//     {"fio": "Никоненко Сергей Викторович", "date": "21.10.1986"},
//     {"fio": "Новичкова Елена Евгеньевна", "date": "26.08.1986"},
//     {"fio": "Овчинникова Валерия Федоровна", "date": "16.04.1993"},
//     {"fio": "Одина Татьяна Борисовна", "date": "08.12.1991"},
//     {"fio": "Оськин Кирилл Витальевич", "date": "15.10.1991"},
//     {"fio": "Павлова Мария Александровна", "date": "01.09.1988"},
//     {"fio": "Папазьян Марина Вагимовна", "date": "19.11.1993"},
//     {"fio": "Паршина Валерия", "date": "13.02.2018"},
//     {"fio": "Перерва Владимир Владимирович", "date": "25.06.1988"},
//     {"fio": "Пивоварова Елена Павловна", "date": "18.06.1959"},
//     {"fio": "Пищулина Дарья Сергеевна", "date": "14.02.1992"},
//     {"fio": "Попова Екатерина Игоревна", "date": "23.07.1992"},
//     {"fio": "Попок Ольга Евгеньевна", "date": "19.05.1979"},
//     {"fio": "Похыла Елена Васильевна", "date": "22.06.1989"},
//     {"fio": "Пупазина Наталья Владимировна", "date": "07.09.1992"},
//     {"fio": "Ралка Екатерина Анатольевна", "date": "18.04.1991"},
//     {"fio": "Расторгуева Анна", "date": "24.11.2017"},
//     {"fio": "Ремель Антонина Васильевна", "date": "25.10.1986"},
//     {"fio": "Риттер Сюзанна Анатольевна", "date": "04.07.1985"},
//     {"fio": "Романенко Елена Николаевна", "date": "09.11.2016"},
//     {"fio": "Саакян Маргарита Арменовна", "date": "23.07.1983"},
//     {"fio": "Савицкий Константин", "date": "21.05.1982"},
//     {"fio": "Саликова Лилия Николаевна", "date": "24.03.1981"},
//     {"fio": "Самойлова Кристина Владимировна", "date": "31.12.1988"},
//     {"fio": "Сапченко Виктория Геннадиевна", "date": "19.04.1990"},
//     {"fio": "Саратова Вера Петровна", "date": "23.06.1987"},
//     {"fio": "Сафонкина Галина Ивановна", "date": "26.10.1987"},
//     {"fio": "Сахарова Марина", "date": "19.05.1978"},
//     {"fio": "Свадьба Бусловых!", "date": "04.12.2010"},
//     {"fio": "Селиванова Нина Александровна", "date": "12.11.1992"},
//     {"fio": "Семенькова Надежда Николаевна", "date": "27.08.1987"},
//     {"fio": "Сёмкина Любовь Викторовна", "date": "24.05.1983"},
//     {"fio": "Сергеева Марина Юрьевна", "date": "13.10.1982"},
//     {"fio": "Сергиенко Елена Сергеевна", "date": "04.08.1978"},
//     {"fio": "Соболева Елена Петровна", "date": "06.07.1990"},
//     {"fio": "Сорочинская Наталья Викторовна", "date": "25.08.1989"},
//     {"fio": "Сорочинский Александр Владимирович", "date": "12.08.1981"},
//     {"fio": "Старченко Виктория Владиславовна", "date": "11.07.1991"},
//     {"fio": "Старченко Дарья Геннадьевна", "date": "26.07.1992"},
//     {"fio": "Стасевич Светлана Юрьевна", "date": "05.07.1987"},
//     {"fio": "Стволовая Алла Владимировна", "date": "20.05.1986"},
//     {"fio": "Стоянова Екатерина Александровна", "date": "01.09.1986"},
//     {"fio": "Тарасова Елена Сергеевна", "date": "18.11.1982"},
//     {"fio": "Татьянин день", "date": "25.01.2017"},
//     {"fio": "Таций Лаура Арсеновна", "date": "12.04.1990"},
//     {"fio": "Терещенко Инна Сергеевна", "date": "13.04.1993"},
//     {"fio": "Ткач Ксения Николаевна", "date": "12.07.1993"},
//     {"fio": "Ткачев Олег", "date": "19.06.1980"},
//     {"fio": "Ткачева Аня", "date": "29.05.2018"},
//     {"fio": "Томин Дмитрий Сергеевич", "date": "22.02.1988"},
//     {"fio": "Трофименкова Анна Александровна", "date": "22.06.1991"},
//     {"fio": "Трухина Юлия Александровна", "date": "14.12.1981"},
//     {"fio": "Усольцева Екатерина Валерьевна", "date": "11.10.1981"},
//     {"fio": "Федоришина Татьяна Тхясеновна", "date": "15.04.1984"},
//     {"fio": "Федоров Арсений", "date": "23.01.2015"},
//     {"fio": "Федоров Роман", "date": "23.06.1976"},
//     {"fio": "Федорова Дарья Викторовна", "date": "16.06.1992"},
//     {"fio": "Федорова Татьяна", "date": "15.11.1978"},
//     {"fio": "Харитонов Генрих Станиславович", "date": "26.10.1993"},
//     {"fio": "Хасанова Галина Владимировна", "date": "25.09.2017"},
//     {"fio": "Храмкова Наталья Владимировна", "date": "13.04.1988"},
//     {"fio": "Цымбал Евгения Васильевна", "date": "15.01.2017"},
//     {"fio": "Червонная Лилия Павловна", "date": "16.08.1989"},
//     {"fio": "Чернова Яна Сергеевна", "date": "15.09.1987"},
//     {"fio": "Чуприна Юлия Владимировна", "date": "24.10.1985"},
//     {"fio": "Шаго Наталья Олеговна", "date": "25.05.1986"},
//     {"fio": "Шакула Светлана Александровна", "date": "15.08.1983"},
//     {"fio": "Шанхоева Любовь Залимхановна", "date": "01.12.1988"},
//     {"fio": "Шенгур Ольга Сергеевна", "date": "29.06.1987"},
//     {"fio": "Шестаков Александр Николаевич", "date": "26.08.1987"},
//     {"fio": "Шумкина Любовь Владимировна", "date": "31.12.1988"},
//     {"fio": "Шуст Лариса Александровна", "date": "02.07.1993"},
//     {"fio": "Якимов Денис Андреевич", "date": "31.01.1992"},
// ];



var xmlHttp = new XMLHttpRequest();


xmlHttp.open( "GET", "http://localhost:8889/birthdays", false); // false for synchronous request
xmlHttp.send( null );

var birthdays = JSON.parse(xmlHttp.responseText);


console.log(birthdays);


const today = new Date();
const tomorrow = new Date(today);
tomorrow.setDate(tomorrow.getDate() + 1);



// change string format of date into Date format
birthdays = birthdays.map(
    function (item) {
        var result = {}
        var dta = item.date.split('.') // parse by dot into array [d, m, y]

        result.fio = item.fio
        result.date = new Date(dta[2], dta[1] - 1, dta[0])

        return result
    }
)


var todayOutput = getArrayForDate(today)
var tomorrowOutput = getArrayForDate(tomorrow)
var weekOutput = []

var adate = new Date(today)
adate.setDate(adate.getDate() + 1) // tomorrow

for (var i = 1; i < 8; i++) {
    adate.setDate(adate.getDate() + 1)
    res = getArrayForDate(adate);
    if (res.length > 0) weekOutput = weekOutput.concat(res)
}

var monthOutput = []

for (var i = 1; i < 23; i++) {
    adate.setDate(adate.getDate() + 1)
    res = getArrayForDate(adate);
    if (res.length > 0) monthOutput = monthOutput.concat(res)
}

var pastOutput = []
adate = new Date(today)
adate.setDate(adate.getDate() - 8) // week ago

for (var i = 1; i < 8; i++) {
    adate.setDate(adate.getDate() + 1)
    res = getArrayForDate(adate);
    if (res.length > 0) pastOutput = pastOutput.concat(res)
}



// function must take a day (today, tomorrow, period by days) and return array with birthdays
function getArrayForDate(currentDate) {
    var result = []

    birthdays.forEach(
        function (item) {
            var date = item.date
            
            if (currentDate.getDate() == date.getDate() && currentDate.getMonth() == date.getMonth()) {
                var yearsOld = currentDate.getYear() - date.getYear()
                var res = {text : item.fio + " " + item.date.toLocaleDateString() + " (" + yearsOld + ")"}
                result.push(res)
            }
        }
    )

    return result
}



    
var app = new Vue({
    el: '#app',
    data: {
        today: today.toLocaleDateString(),
        tomorrow: tomorrow.toLocaleDateString(),
        pasts : pastOutput,
        todays: todayOutput,
        tomorrows: tomorrowOutput,
        weeks: weekOutput,
        months: monthOutput
    }
});

